package com.rsschool.quiz

class Db {
    companion object {
        val questionsList: Map<Int, String> = mapOf(
            1 to "Каким своим изобретением русский народ только сам пользуется?",
            2 to "Сколько глаз у пчелы?",
            3 to "Сколько ГигаПевтов в семи ТераПевтах?",
            4 to "Какая часть света самая высокая?",
            5 to "Кто написал серию книг Дум/Doom?")
        val rightAnswersList: Map<Int, String> = mapOf(1 to "2", 2 to "1", 3 to "2", 4 to "1", 5 to "4")
        val answersList: Map<Int, List<String>> = mapOf(
            1 to listOf("Тетрис", "Самовар", "Монорельс", "Велосипед", "Парашют"),
            2 to listOf("Пять", "Два", "Три", "Восемь", "Шесть"),
            3 to listOf("8192", "7168", "8198", "7192", "7032"),
            4 to listOf("Азия", "Австралия", "Америка", "Африка", "Европа"),
            5 to listOf("Гарри Гаррисон, Айзек Азимов", "Айзек Азимов", "Клифорд Саймак", "Девид Аб Хью, Бред Линавивер", "Стивен Кинг, Курт Воннегут"))
    }
}